# How to find and remove duplicate rows in pandas?

In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [6]:
# read a dataset of movie reviewers (modifying the default parameter values for read_table)
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols, index_col='user_id')

In [7]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [9]:
users.shape

(943, 4)

In [12]:
# To get the list of duplicated rows:
users.zip_code.duplicated() 
#The row which is marked as True is a duplicate row

#How this output does not say it is a duplicate of which row

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940     True
941    False
942    False
943    False
Name: zip_code, Length: 943, dtype: bool

In [15]:
# To count the number of duplicate rows
users.zip_code.duplicated().sum()

148

In [16]:
# Now ler's look at the duplicates in the data frame as a whole instead of the series
users.duplicated() # This wll output True is an entire row is identical to a previous row

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool

In [17]:
users.duplicated().sum()

7

In [19]:
# To see those rows,
# But, this does not say if the first row found or the last row is a duplicate
users.loc[users.duplicated(),:]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [20]:
# To mark the first row as a duplicate use keep = 'first'
# The first occurance is kept and all other repetaation is marked as duplicate
users.loc[users.duplicated(keep = 'first'),:]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301